[net]
# Testing
batch=1
subdivisions=1
# Training
#batch=64
#subdivisions=2
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=500          #前50代不使用steps策略调整学习率
max_batches = 25000
policy=steps
steps=15000,20000
scales=.1,.1      #steps策略表示，200代之后学习率缩小0.1，400代之后再缩小0.1

# 0
[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

# 1
[maxpool]
size=2
stride=2

# 2
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# 3
[maxpool]
size=2
stride=2

# 4
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

# 5
[maxpool]
size=2
stride=2

# 6
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

# 7
[maxpool]
size=2
stride=2

# 8
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

# 9
[maxpool]
size=2
stride=2

# 10
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

# 11
[maxpool]
size=2
stride=1

# 12
[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky


# 13
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

# 关掉13*13层
# 14
# [convolutional]
# batch_normalize=1
# filters=512
# size=3
# stride=1
# pad=1
# activation=leaky

# 15
# [convolutional]
# size=1
# stride=1
# pad=1
# filters=18
# activation=linear

# 16
# [yolo]
# mask = 6,7,8
# anchors = 8,16,  16,17,  12,34,  24,24,  16,60,  42,31,  32,73,  95,48,  53,137
# classes=1
# num=6
# jitter=.3
# ignore_thresh = .7
# truth_thresh = 1
# random=0

# 17
# [route]
# layers = -4

# 18
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# 19
[upsample]
stride=2

# 20
[route]
layers = -1, 8

# 21
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

# 22
[convolutional]
size=1
stride=1
pad=1
filters=18 
activation=linear

# 23
[yolo]
mask = 3,4,5
anchors = 8,16,  16,17,  12,34,  24,24,  16,60,  42,31,  32,73,  95,48,  53,137
classes=1
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=0


# 添加52*52层的输出
[route]
layers = -4

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 6

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear

[yolo]
mask = 0,1,2
anchors = 8,16,  16,17,  12,34,  24,24,  16,60,  42,31,  32,73,  95,48,  53,137
classes=1
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=0